fedex-api/RateService/Intra IN_SUCCESS__OK_Request.txt

<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns="http://fedex.com/ws/rate/v31">
   <SOAP-ENV:Body>
      <RateRequest>
        <WebAuthenticationDetail>
            <ParentCredential>
               <Key>Input your Information</Key>
               <Password>Input your Information</Password>
            </ParentCredential>
            <UserCredential>
               <Key>Input your Information</Key>
               <Password>Input your Information</Password>
            </UserCredential>
         </WebAuthenticationDetail>
         <ClientDetail>
            <AccountNumber>Input your Information</AccountNumber>
            <MeterNumber>Input your Information</MeterNumber>
         </ClientDetail>
         <TransactionDetail>
            <CustomerTransactionId>Domestic Express_INTRA IN</CustomerTransactionId>
         </TransactionDetail>
         <Version>
            <ServiceId>crs</ServiceId>
            <Major>31</Major>
            <Intermediate>0</Intermediate>
            <Minor>0</Minor>
         </Version>
         <RequestedShipment>
            <ShipTimestamp>2021-04-01T12:34:56-06:00</ShipTimestamp>
            <DropoffType>REGULAR_PICKUP</DropoffType>
            <ServiceType>FEDEX_EXPRESS_SAVER</ServiceType>
            <PackagingType>YOUR_PACKAGING</PackagingType>
            <TotalWeight>
               <Units>KG</Units>
               <Value>20</Value>
            </TotalWeight>
            <TotalInsuredValue>
               <Currency>INR</Currency>
               <Amount>100</Amount>
            </TotalInsuredValue>
            <PreferredCurrency>INR</PreferredCurrency>
            <Shipper>
               <Contact>
                  <PersonName>Input your Information</PersonName>
                  <CompanyName>Input your Information</CompanyName>
                  <PhoneNumber>Input your Information</PhoneNumber>
                  <EMailAddress>Input your Information</EMailAddress>
               </Contact>
               <Address>
                  <StreetLines>Shipper Address Line 1</StreetLines>
                  <StreetLines>Shipper Address Line 2</StreetLines>
                  <City>Bhopal</City>
                  <StateOrProvinceCode>IN</StateOrProvinceCode>
                  <PostalCode>462011</PostalCode>
                  <CountryCode>IN</CountryCode>
               </Address>
            </Shipper>
            <Recipient>
               <Contact>
                  <PersonName>Input your Information</PersonName>
                  <CompanyName>Input your Information</CompanyName>
                  <PhoneNumber>Input your Information</PhoneNumber>
                  <EMailAddress>Input your Information</EMailAddress>
               </Contact>
               <Address>
                  <StreetLines>TC012 JAN 20 APAC</StreetLines>
                  <StreetLines>ExpSaver - CuPack - Intra IN </StreetLines>
                  <City>Kanpur</City>
                  <StateOrProvinceCode>IN</StateOrProvinceCode>
                  <PostalCode>208001</PostalCode>
                  <CountryCode>IN</CountryCode>
               </Address>
            </Recipient>
            <ShippingChargesPayment>
               <PaymentType>SENDER</PaymentType>
               <Payor>
                  <ResponsibleParty>
                     <AccountNumber>Input your Information</AccountNumber>
                     <Contact>
                        <ContactId>12345</ContactId>
                        <PersonName>Dhillon</PersonName>
                     </Contact>
                  </ResponsibleParty>
               </Payor>
            </ShippingChargesPayment>
 <CustomsClearanceDetail>
               <CustomsOptions>
                  <Type>FAULTY_ITEM</Type>
                  <Description>rapidi secum</Description>
               </CustomsOptions>
               <DutiesPayment>
                  <PaymentType>SENDER</PaymentType>
                  <Payor>
                     <ResponsibleParty>
                        <AccountNumber>Input your Information</AccountNumber>
                     </ResponsibleParty>
                  </Payor>
               </DutiesPayment>
               <DocumentContent>NON_DOCUMENTS</DocumentContent>
               <CustomsValue>
                  <Currency>INR</Currency>
                  <Amount>100</Amount>
               </CustomsValue>
               <CommercialInvoice>
                  <Purpose>GIFT</Purpose>
               </CommercialInvoice>
               <Commodities>
                  <NumberOfPieces>1</NumberOfPieces>
                  <Description>BOOKS</Description>
                  <CountryOfManufacture>US</CountryOfManufacture>
                  <Weight>
                     <Units>KG</Units>
                     <Value>10</Value>
                  </Weight>
                  <Quantity>1</Quantity>
                  <QuantityUnits>IN</QuantityUnits>
                  <UnitPrice>
                     <Currency>INR</Currency>
                     <Amount>100</Amount>
                  </UnitPrice>
                  <CustomsValue>
                     <Currency>INR</Currency>
                     <Amount>100</Amount>
                  </CustomsValue>
               </Commodities>
            </CustomsClearanceDetail>            
            <RateRequestTypes>LIST</RateRequestTypes>
            <PackageCount>1</PackageCount>
            <RequestedPackageLineItems>
               <SequenceNumber>1</SequenceNumber>
               <GroupNumber>1</GroupNumber>
               <GroupPackageCount>1</GroupPackageCount>
               <InsuredValue>
                  <Currency>INR</Currency>
                  <Amount>100</Amount>
               </InsuredValue>
               <Weight>
                  <Units>KG</Units>
                  <Value>20</Value>
               </Weight>
               <Dimensions>
                  <Length>10</Length>
                  <Width>20</Width>
                  <Height>20</Height>
                  <Units>CM</Units>
               </Dimensions>
               </RequestedPackageLineItems>
         </RequestedShipment>
      </RateRequest>
   </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
